MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL03Z8VFG4/mcu.h
#define ISF                           0x7FFFFFFF80000000      // Interrupt Status Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDOR register.
//
//*****************************************************************************

#define PDO                           0x7FFFFFFF80000000      // Port Data Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PSOR register.
//
//*****************************************************************************

#define PTSO                          0x7FFFFFFF80000000      // Port Set Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PCOR register.
//
//*****************************************************************************

#define PTCO                          0x7FFFFFFF80000000      // Port Clear Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PTOR register.
//
//*****************************************************************************

#define PTTO                          0x7FFFFFFF80000000      // Port Toggle Output


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDIR register.
//
//*****************************************************************************

#define PDI                           0x7FFFFFFF80000000      // Port Data Input


//*****************************************************************************
//
// The following are defines for the bit fields in the GPIOx_PDDR register.
//
//*****************************************************************************

#define PDD                           0x7FFFFFFF80000000      // Port Data Direction


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

#define OSC32KSEL                     0x00180000      // 32K Oscillator Clock Select
#define OSC32KOUT                     0x00060000      // 32K oscillator clock output


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define LPUART0SRC                    0x18000000      // LPUART0 Clock Source Select
#define TPMSRC                        0x06000000      // TPM Clock Source Select
#define CLKOUTSEL                     0x00000380      // CLKOUT select
#define RTCCLKOUTSEL                  0x00000010      // RTC   Clock Out Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

#define TPM1CLKSEL                    0x02000000      // TPM1 External Clock Pin Select
#define TPM0CLKSEL                    0x01000000      // TPM0 External Clock Pin Select
#define TPM1CH0SRC                    0x00040000      // TPM1 Channel 0 Input Capture Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT5 register.
//
//*****************************************************************************

#define LPUART0ODE                    0x00010000      // LPUART0 Open Drain Enable
#define LPUART0RXSRC                  0x00000004      // LPUART0 Receive Data Source Select
#define LPUART0TXSRC                  0x00000001      // LPUART0 transmit data source select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT7 register.
//
//*****************************************************************************

#define ADC0ALTTRGEN                  0x00000080      // ADC0 Alternate Trigger Enable
#define ADC0PRETRGSEL                 0x00000010      // ADC0 Pretrigger Select
#define ADC0TRGSEL                    0x00000078      // ADC0 Trigger Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SDID register.
//
//*****************************************************************************

#define FAMID                         0x780000000      // Kinetis family ID
#define SUBFAMID                      0x78000000      // Kinetis Sub-Family ID
#define SERIESID                      0x07800000      // Kinetis Series ID
#define SRAMSIZE                      0x00780000      // System SRAM Size
#define REVID                         0x00078000      // Device Revision Number
#define DIEID                         0x0000F800      // Device Die Number
#define PINID                         0x000001C0      // Pincount Identification


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC4 register.
//
//*****************************************************************************

#define SPI0                          0x00400000      // SPI0 Clock Gate Control
#define VREF                          0x00100000      // VREF Clock Gate Control
#define CMP0                          0x00080000      // Comparator Clock Gate Control
#define I2C0                          0x00000040      // I2C0 Clock Gate Control


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SCGC5 register.
//
//*****************************************************************************

